## Plan Result (ptl-netbox)




<pre><code>Plan: 9 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault.netbox_key_vault
  * azurerm_key_vault_secret.POSTGRES-DATABASE
  * azurerm_key_vault_secret.POSTGRES-HOST
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-USER
  * azurerm_key_vault_secret.redis_accesskey
  * azurerm_key_vault_secret.redis_hostname
  * azurerm_key_vault_secret.redis_port
  * azurerm_resource_group.netbox_rg




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault.netbox_key_vault will be created
  + resource "azurerm_key_vault" "netbox_key_vault" {
      + access_policy                 = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "netbox-vault-ptl"
      + public_network_access_enabled = true
      + resource_group_name           = "netbox-ptl-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/rdo-netbox"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                     = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-DATABASE will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-DATABASE" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "netbox-POSTGRES-DATABASE-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-HOST will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-HOST" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "netbox-POSTGRES-HOST-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-PASS will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "netbox-POSTGRES-PASS-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "netbox-POSTGRES-USER-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.redis_accesskey will be created
  + resource "azurerm_key_vault_secret" "redis_accesskey" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "netbox-redis-accesskey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.redis_hostname will be created
  + resource "azurerm_key_vault_secret" "redis_hostname" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "netbox-redis-hostname"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.redis_port will be created
  + resource "azurerm_key_vault_secret" "redis_port" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "netbox-redis-port"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.netbox_rg will be created
  + resource "azurerm_resource_group" "netbox_rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "netbox-ptl-rg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/rdo-netbox"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":17,"Program":"tfcmt","SHA1":"","Target":"ptl-netbox","Vars":{}} -->